In [153]:
import pandas as pd 

# menggunakan list

data = [
    [12,3],
    [13,14],
    [15,16]
]

df = pd.DataFrame(data)
df

    0   1
0  12   3
1  13  14
2  15  16

In [154]:
# menggunakan dictionary

data = {
    "nama" : ["agung", "emi", "william"],
    "umur" : [20, 25, 20],
    "alamat" : ["denpasar", "gianyar", "suroboyo"]
}

df = pd.DataFrame(data)
df

      nama  umur    alamat
0    agung    20  denpasar
1      emi    25   gianyar
2  william    20  suroboyo

In [155]:
df.index = [1,2,3]
df

      nama  umur    alamat
1    agung    20  denpasar
2      emi    25   gianyar
3  william    20  suroboyo

In [156]:
df.columns = ["name", "age", "address"]
df

      name  age   address
1    agung   20  denpasar
2      emi   25   gianyar
3  william   20  suroboyo

In [157]:
df.columns

Index(['name', 'age', 'address'], dtype='object')

In [158]:
df["name"] # memanggil dengan series

1      agung
2        emi
3    william
Name: name, dtype: object

In [159]:
df.loc[1]

name          agung
age              20
address    denpasar
Name: 1, dtype: object

In [160]:
df.loc[1:3]

      name  age   address
1    agung   20  denpasar
2      emi   25   gianyar
3  william   20  suroboyo

In [161]:
df.loc[1:3, "name" : "age"] # [baris, kolom]

      name  age
1    agung   20
2      emi   25
3  william   20

In [162]:
df.iloc[0]

name          agung
age              20
address    denpasar
Name: 1, dtype: object

In [163]:
df.iloc[0:2]

    name  age   address
1  agung   20  denpasar
2    emi   25   gianyar

In [164]:
df.iloc[0:2,0:2]

    name  age
1  agung   20
2    emi   25

In [165]:
df

      name  age   address
1    agung   20  denpasar
2      emi   25   gianyar
3  william   20  suroboyo

CONDITIONAL DATAFRAME

In [166]:
data = {
    "nama" : ["agung", "emi", "william", "fafa"],
    "umur" : [20, 25, 20, 19],
    "alamat" : ["denpasar", "gianyar", "suroboyo", "denpasar"]
}

df = pd.DataFrame(data)
df

      nama  umur    alamat
0    agung    20  denpasar
1      emi    25   gianyar
2  william    20  suroboyo
3     fafa    19  denpasar

In [167]:
df["umur"] > 19

0     True
1     True
2     True
3    False
Name: umur, dtype: bool

In [168]:
df.loc[df["umur"] > 19]

      nama  umur    alamat
0    agung    20  denpasar
1      emi    25   gianyar
2  william    20  suroboyo

In [169]:
df.loc[df["umur"] > 19, "alamat"]

0    denpasar
1     gianyar
2    suroboyo
Name: alamat, dtype: object

In [170]:
df.loc[df["umur"] > 19, ["umur", "alamat"]]

   umur    alamat
0    20  denpasar
1    25   gianyar
2    20  suroboyo

In [171]:
df.loc[(df["umur"] > 19) & (df["umur"] < 25)]

      nama  umur    alamat
0    agung    20  denpasar
2  william    20  suroboyo

In [172]:
df

      nama  umur    alamat
0    agung    20  denpasar
1      emi    25   gianyar
2  william    20  suroboyo
3     fafa    19  denpasar

In [173]:
df.drop(3, inplace=True) # cara 1

# df = df.drop(3) # cara 2

In [174]:
df.drop([0,2], inplace=True)

In [175]:
df

  nama  umur   alamat
1  emi    25  gianyar

In [176]:
df.drop(columns = ["nama", "umur"], inplace=True)
df

    alamat
1  gianyar

In [177]:
df["gaji"] = [1000, 2000, 3000, 4000]
df

ValueError: Length of values (4) does not match length of index (1)

In [52]:
df["total gaji"] = df["umur"] * df["gaji"]
df

      nama  umur    alamat  gaji  total gaji
0    agung    20  denpasar  1000       20000
1      emi    25   gianyar  2000       50000
2  william    20  suroboyo  3000       60000
3     fafa    19  denpasar  4000       76000

In [53]:
df["total gaji"] = df["total gaji"] - 500
df

      nama  umur    alamat  gaji  total gaji
0    agung    20  denpasar  1000       19500
1      emi    25   gianyar  2000       49500
2  william    20  suroboyo  3000       59500
3     fafa    19  denpasar  4000       75500

In [55]:
df.rename(
    columns = {
        "nama" : "name",
        "umur" : "age",
        "alamat" : "address",
        "gaji" : "salary",
        "total gaji" : "total salary"
    }, inplace = True
)

df

      name  age   address  salary  total salary
0    agung   20  denpasar    1000         19500
1      emi   25   gianyar    2000         49500
2  william   20  suroboyo    3000         59500
3     fafa   19  denpasar    4000         75500

In [59]:
df["name"].replace("fafa", "fufu", inplace=True)
df

      name  age   address  salary  total salary
0    agung   20  denpasar    1000         19500
1      emi   25   gianyar    2000         49500
2  william   20  suroboyo    3000         59500
3     fufu   19  denpasar    4000         75500

In [62]:
df["address"] = df["address"].replace(["denpasar", "suroboyo"], ["bangli", "jakarta"])
df

      name  age  address  salary  total salary
0    agung   20   bangli    1000         19500
1      emi   25  gianyar    2000         49500
2  william   20  jakarta    3000         59500
3     fufu   19   bangli    4000         75500

READING FILE EXTERNAL

In [181]:
data = pd.read_csv("covid19.csv", header = None)
data.drop(0, inplace=True)
data.columns = ["Tanggal", "ODP", "PDP", "Kasus Positif", "Kases Sembuh", "Kasus Meninggal"]
data

      Tanggal  ODP  PDP Kasus Positif Kases Sembuh Kasus Meninggal
1   3/26/2020  204   89            17            0               4
2   3/27/2020  207   99            17            0               4
3   3/29/2020  256  119            28            0               4
4   3/30/2020  262  123            31            0               6
5   3/31/2020  308  134            34            2               6
6    4/1/2020  336  139            38            2               6
7    4/2/2020  371  156            40            2              10
8    4/5/2020  416  170            42            2              10
9    4/6/2020  450  184            43            2              11
10   4/8/2020  525  196            44            2              13
11  4/11/2020  600  230            47            2              15
12  4/12/2020  606  231            49            2              16
13  4/13/2020  630  239            50            3              16
14  4/14/2020  629  245            44            9              16

In [182]:
data.shape

(14, 6)

In [183]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 1 to 14
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Tanggal          14 non-null     object
 1   ODP              14 non-null     object
 2   PDP              14 non-null     object
 3   Kasus Positif    14 non-null     object
 4   Kases Sembuh     14 non-null     object
 5   Kasus Meninggal  14 non-null     object
dtypes: object(6)
memory usage: 804.0+ bytes

In [186]:
data.head(10)

      Tanggal  ODP  PDP Kasus Positif Kases Sembuh Kasus Meninggal
1   3/26/2020  204   89            17            0               4
2   3/27/2020  207   99            17            0               4
3   3/29/2020  256  119            28            0               4
4   3/30/2020  262  123            31            0               6
5   3/31/2020  308  134            34            2               6
6    4/1/2020  336  139            38            2               6
7    4/2/2020  371  156            40            2              10
8    4/5/2020  416  170            42            2              10
9    4/6/2020  450  184            43            2              11
10   4/8/2020  525  196            44            2              13

In [188]:
data.tail(8)

      Tanggal  ODP  PDP Kasus Positif Kases Sembuh Kasus Meninggal
7    4/2/2020  371  156            40            2              10
8    4/5/2020  416  170            42            2              10
9    4/6/2020  450  184            43            2              11
10   4/8/2020  525  196            44            2              13
11  4/11/2020  600  230            47            2              15
12  4/12/2020  606  231            49            2              16
13  4/13/2020  630  239            50            3              16
14  4/14/2020  629  245            44            9              16